_notes/2022-06-21-setting-up-nvme-cli-and-retrieving-zns-info.html
---
layout: post
title: "NVMe-CLI"
short: "Setting up NVMe-CLi and retrieving NVMe SSD info"
category: benchmarking
status: WIP
---

<div id="outline-container-org1c65e9c" class="outline-2">
<h2 id="org1c65e9c"><span class="section-number-2">1.</span> Setting up NVMe-CLI</h2>
<div class="outline-text-2" id="text-1">
<p>
A good approach to get the most modern features is to build nvme-cli yourself. For this, you can do:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">git</span> clone https://github.com/linux-nvme/nvme-cli.git
<span style="color: #fabd2f;">cd</span> nvme-cli
<span style="color: #928374;"># </span><span style="color: #928374;">Follow instructions at https://github.com/linux-nvme/nvme-cli</span>
</pre>
</div>
<p>
Then simply check if it works by listing all NVMe capable devices and see if they are all there:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">sudo</span> nvme list
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3ed190" class="outline-2">
<h2 id="orge3ed190"><span class="section-number-2">2.</span> Using nvme-cli to get NVMe stats</h2>
<div class="outline-text-2" id="text-2">
<p>
The NVMe standard specifies that NVMe SSDs should support a functionality known as smart-log. This contains some basic metrics that can be used to get information from the SSD. A few of those metrics are predefined and are therefore available on most NVMe SSDs, provided they are made in a reliable in trustworthy manner. This can be beneficial for benchmarking, a few helpful ones include:
</p>
<ul class="org-ul">
<li>host<sub>write</sub><sub>commands</sub>: the total number of write commands issued on the host side</li>
<li>host<sub>read</sub><sub>commands</sub>: the total number of read commands issued on the host side</li>
<li>data<sub>units</sub><sub>written</sub>: total number of &ldquo;data units&rdquo; written to the device with Data Units Written. When the value remains 0h, Data Units Written is not reported.</li>
<li>data<sub>units</sub><sub>read</sub>: total number of &ldquo;data units&rdquo; read from the device with the SMART Data Units Read Command</li>
</ul>

<p>
The unit &ldquo;data units&rdquo; is slightly confusing, as it is a non-conventional unit (outside of the NVMe spec :smile: ). Looking at the most recent NVMe specifics (as of June 2022) it is units of 1000 LBA size blocks, when the LBA size is 512 bytes, excluding metadata updates. This value is always rounded up. Meaning that even if only 512 bytes are written, the system would still indicate 1 data unit written (1000*512). In an older version of the NVMe spec, it is stated that LBa sizes different than 512 are converted for the smart-log to 512 units anyway, this is something to look out for&#x2026; Preferably, this should be tested for each device used. But always, multiply with 512*1000 and assume an error of ~ 512*1000 - lbasize.
</p>

<p>
An easy way to get the actions issued between an I/O heavy application is to log before the I/O heavy application starts and to measure afterwards. Do ensure that nothing else writes to the device in the meantime as smart-log does not differentiate between the applications, that is an OS thing. Information can be retrieved with for example:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fabd2f;">sudo</span> nvme smart-log -o json <span style="color: #b8bb26;">"/dev/&lt;nvmedev&gt;"</span> <span style="color: #928374;"># </span><span style="color: #928374;">with &lt;nvmedev&gt; the device name</span>
</pre>
</div>
<p>
The simply process with a tool like `jq` or `awk` to get the appropriate field.
</p>
</div>
</div>
